ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32L43x/N32L436.svd
            </registers>
        </peripheral>

        <peripheral>
            <name>EXTI</name>
            <description>external interrupt/event controller</description>
            <groupName>EXTI</groupName>
            <baseAddress>0x40010400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x20</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>EXTI0</name>
                <description>EXTI0 interrupt</description>
                <value>6</value>
            </interrupt>
            <interrupt>
                <name>EXTI1</name>
                <description>EXTI1 interrupt</description>
                <value>7</value>
            </interrupt>
            <interrupt>
                <name>EXTI2</name>
                <description>EXTI2 interrupt</description>
                <value>8</value>
            </interrupt>
            <interrupt>
                <name>EXTI3</name>
                <description>EXTI3 interrupt</description>
                <value>9</value>
            </interrupt>
            <interrupt>
                <name>EXTI4</name>
                <description>EXTI4 interrupt</description>
                <value>10</value>
            </interrupt>
            <interrupt>
                <name>EXTI9_5</name>
                <description>EXTI5/6/7/8/9 interrupt</description>
                <value>23</value>
            </interrupt>
            <interrupt>
                <name>EXTI15_10</name>
                <description>EXTI10/11/12/13/14/15 interrupt</description>
                <value>40</value>
            </interrupt>
            <registers>
                <register>
                    <name>EXTI_IMASK</name>
                    <displayName>EXTI_IMASK</displayName>
                    <description>EXTI_IMASK</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0fffffff</resetMask>
                    <fields>
                        <field>
                            <name>IMASK</name>
                            <description>IMASK</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>28</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXTI_EMASK</name>
                    <displayName>EXTI_EMASK</displayName>
                    <description>EXTI_EMASK</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0fffffff</resetMask>
                    <fields>
                        <field>
                            <name>EMASK</name>
                            <description>EMASK</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>28</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXTI_RT_CFG</name>
                    <displayName>EXTI_RT_CFG</displayName>
                    <description>EXTI_RT_CFG</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0fffffff</resetMask>
                    <fields>
                        <field>
                            <name>RT_CFG</name>
                            <description>RT_CFG</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>28</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXTI_FT_CFG</name>
                    <displayName>EXTI_FT_CFG</displayName>
                    <description>EXTI_FT_CFG</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0fffffff</resetMask>
                    <fields>
                        <field>
                            <name>FT_CFG</name>
                            <description>FT_CFG</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>28</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXTI_SWIE</name>
                    <displayName>EXTI_SWIE</displayName>
                    <description>EXTI_SWIE</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0fffffff</resetMask>
                    <fields>
                        <field>
                            <name>SWIE</name>
                            <description>SWIE</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>28</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXTI_PEND</name>
                    <displayName>EXTI_PEND</displayName>
                    <description>EXTI_PEND</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0fffffff</resetMask>
                    <fields>
                        <field>
                            <name>PEND0</name>
                            <description>PEND0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND1</name>
                            <description>PEND1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND2</name>
                            <description>PEND2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND3</name>
                            <description>PEND3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND4</name>
                            <description>PEND4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND5</name>
                            <description>PEND5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND6</name>
                            <description>PEND6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND7</name>
                            <description>PEND7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND8</name>
                            <description>PEND8</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND9</name>
                            <description>PEND9</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND10</name>
                            <description>PEND10</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND11</name>
                            <description>PEND11</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND12</name>
                            <description>PEND12</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND13</name>
                            <description>PEND13</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND14</name>
                            <description>PEND14</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND15</name>
                            <description>PEND15</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND16</name>
                            <description>PEND16</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND17</name>
                            <description>PEND17</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND18</name>
                            <description>PEND18</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND19</name>
                            <description>PEND19</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND20</name>
                            <description>PEND20</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND21</name>
                            <description>PEND21</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND22</name>
                            <description>PEND22</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND23</name>
                            <description>PEND23</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND24</name>
                            <description>PEND24</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND25</name>
                            <description>PEND25</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND26</name>
                            <description>PEND26</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEND27</name>
                            <description>PEND27</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXTI_TS_SEL</name>
                    <displayName>EXTI_TS_SEL</displayName>
                    <description>EXTI_TS_SEL</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000000f</resetMask>
                    <fields>
                        <field>
                            <name>TSSEL</name>
                            <description>TSSEL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
