ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32L43x/N32L436.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="I2C1">
            <name>I2C2</name>
            <baseAddress>0x40005800</baseAddress>
            <interrupt>
                <name>I2C2_EV</name>
                <description>I2C2 Event interrupt</description>
                <value>33</value>
            </interrupt>
            <interrupt>
                <name>I2C2_ER</name>
                <description>I2C2 Error interrupt</description>
                <value>34</value>
            </interrupt> 			
		</peripheral>

        <peripheral>
            <name>IWDG</name>
            <description>Independent watchdog</description>
            <groupName>IWDG</groupName>
            <baseAddress>0x40003000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>IWDG_KEY</name>
                    <displayName>IWDG_KEY</displayName>
                    <description>IWDG_KEY</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>KEYV</name>
                            <description>KEYV</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IWDG_PREDIV</name>
                    <displayName>IWDG_PREDIV</displayName>
                    <description>IWDG_PREDIV</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000007</resetMask>
                    <fields>
                        <field>
                            <name>PD</name>
                            <description>PD</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IWDG_RELV</name>
                    <displayName>IWDG_RELV</displayName>
                    <description>IWDG_RELV</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000fff</resetValue>
                    <resetMask>0x00000fff</resetMask>
                    <fields>
                        <field>
                            <name>REL</name>
                            <description>REL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IWDG_STS</name>
                    <displayName>IWDG_STS</displayName>
                    <description>IWDG_STS</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>PVU</name>
                            <description>PVU</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CRVU</name>
                            <description>CRVU</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>

		<peripheral>
            <name>LPRCNT</name>
            <description>low power rotation counter control</description>
            <groupName>LPRCNT</groupName>
            <baseAddress>0x40003800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>LPRCNT</name>
                <description>LPRCNT turns overflow interrupt</description>
                <value>152</value>
            </interrupt>
            <registers>
                <register>
                    <name>LPRCNT_CTRL</name>
                    <displayName>LPRCNT_CTRL</displayName>
                    <description>LPRCNT_CTRL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x7fffffff</resetMask>
                    <fields>
                        <field>
                            <name>RPTTH</name>
                            <description>RPTTH</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>CLKDIV</name>
                            <description>CLKDIV</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>AVGSEL</name>
                            <description>AVGSEL</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CNTDIR</name>
                            <description>CNTDIR</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>PWRLVL</name>
                            <description>PWRLVL</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>	
                        <field>
                            <name>CMPAUT</name>
                            <description>CMPAUT</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>RCNTM</name>
                            <description>RCNTM</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>CALM</name>
                            <description>CALM</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>ALMPRD</name>
                            <description>ALMPRD</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>	
                        <field>
                            <name>ALMIE</name>
                            <description>ALMIE</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>RPTIE</name>
                            <description>RPTIE</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>CALIE</name>
                            <description>CALIE</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>																			
                    </fields>
                </register>
                <register>
                    <name>LPRCNT_INTSTS</name>
                    <displayName>LPRCNT_INTSTS</displayName>
                    <description>LPRCNT_INTSTS</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <access>read</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0007ffff</resetMask>
                    <fields>
                        <field>
                            <name>RPTVAL</name>
                            <description>RPTVAL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>ALMIF</name>
                            <description>ALMIF</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RPTIF</name>
                            <description>RPTIF</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>		
                        <field>
                            <name>CALIF</name>
                            <description>CALIF</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>							
                    </fields>
                </register>	
                <register>
                    <name>LPRCNT_SCTRL</name>
                    <displayName>LPRCNT_SCTRL</displayName>
                    <description>LPRCNT_SCTRL</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x03ffffff</resetMask>
                    <fields>
                        <field>
                            <name>HSPRD</name>
                            <description>HSPRD</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SWT</name>
                            <description>SWT</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>LSPRD</name>
                            <description>LSPRD</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>						
                    </fields>
                </register>	
                <register>
                    <name>LPRCNT_CH0CFG0</name>
                    <displayName>LPRCNT_CH0CFG0</displayName>
                    <description>LPRCNT_CH0CFG0</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00212c24</resetValue>
                    <resetMask>0x003fffff</resetMask>
                    <fields>
                        <field>
                            <name>DAMTH</name>
                            <description>DAMTH</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>UNDTH</name>
                            <description>UNDTH</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DACREF</name>
                            <description>DACREF</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>											
                    </fields>
                </register>	
                <register>
                    <name>LPRCNT_CH0CFG1</name>
                    <displayName>LPRCNT_CH0CFG1</displayName>
                    <description>LPRCNT_CH0CFG1</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00500302</resetValue>
                    <resetMask>0x00ff3f3f</resetMask>
                    <fields>
                        <field>
                            <name>CHGDUR</name>
                            <description>CHGDUR</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>DSCDUR</name>
                            <description>DSCDUR</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DAMDUR</name>
                            <description>DAMDUR</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>						
                    </fields>
                </register>		
                <register>
                    <name>LPRCNT_CH1CFG0</name>
                    <displayName>LPRCNT_CH1CFG0</displayName>
                    <description>LPRCNT_CH1CFG0</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00212c24</resetValue>
                    <resetMask>0x003fffff</resetMask>
                    <fields>
                        <field>
                            <name>DAMTH</name>
                            <description>DAMTH</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>UNDTH</name>
                            <description>UNDTH</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DACREF</name>
                            <description>DACREF</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>											
                    </fields>
                </register>	
                <register>
                    <name>LPRCNT_CH1CFG1</name>
                    <displayName>LPRCNT_CH1CFG1</displayName>
                    <description>LPRCNT_CH1CFG1</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00500302</resetValue>
                    <resetMask>0x00ff3f3f</resetMask>
                    <fields>
                        <field>
                            <name>CHGDUR</name>
                            <description>CHGDUR</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>DSCDUR</name>
                            <description>DSCDUR</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DAMDUR</name>
                            <description>DAMDUR</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>						
                    </fields>
                </register>	
                <register>
                    <name>LPRCNT_CH2CFG0</name>
                    <displayName>LPRCNT_CH2CFG0</displayName>
                    <description>LPRCNT_CH2CFG0</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00212c24</resetValue>
                    <resetMask>0x003fffff</resetMask>
                    <fields>
                        <field>
                            <name>DAMTH</name>
                            <description>DAMTH</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>UNDTH</name>
                            <description>UNDTH</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DACREF</name>
                            <description>DACREF</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>											
                    </fields>
                </register>	
                <register>
                    <name>LPRCNT_CH2CFG1</name>
                    <displayName>LPRCNT_CH2CFG1</displayName>
                    <description>LPRCNT_CH2CFG1</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00500302</resetValue>
                    <resetMask>0x00ff3f3f</resetMask>
                    <fields>
                        <field>
                            <name>CHGDUR</name>
                            <description>CHGDUR</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>DSCDUR</name>
                            <description>DSCDUR</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DAMDUR</name>
                            <description>DAMDUR</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>						
                    </fields>
                </register>		
                <register>
                    <name>LPRCNT_CMD</name>
                    <displayName>LPRCNT_CMD</displayName>
                    <description>LPRCNT_CMD</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000007</resetMask>
                    <fields>
                        <field>
                            <name>START</name>
                            <description>START</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STOP</name>
                            <description>STOP</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLRF</name>
                            <description>CLRF</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                    </fields>
                </register>		
                <register>
                    <name>LPRCNT_CAL0</name>
                    <displayName>LPRCNT_CAL0</displayName>
                    <description>LPRCNT_CAL0</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x03ff03ff</resetMask>
                    <fields>
                        <field>
                            <name>CH0CNT</name>
                            <description>CH0CNT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>CH0STS</name>
                            <description>CH0STS</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CH1CNT</name>
                            <description>CH1CNT</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>	
                        <field>
                            <name>CH1STS</name>
                            <description>CH1STS</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>						
                    </fields>
                </register>					
